---
kind: method
id: M:Autodesk.Revit.DB.RenderingQualitySettings.Dispose
source: html/4dfdc92b-d398-8bcb-12e8-2b791fd30afb.htm
---
# Autodesk.Revit.DB.RenderingQualitySettings.Dispose Method

Releases all resources used by the RenderingQualitySettings

## Syntax (C#)
```csharp
public void Dispose()
```